{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"consume_less": "cpu", "return_sequences": true, "go_backwards": false, "stateful": false, "unroll": false, "output_dim": 10, "name": "lstm_4", "init": "glorot_uniform", "input_dtype": "float32", "activation": "tanh", "forget_bias_init": "one", "input_dim": 1, "U_regularizer": null, "trainable": true, "dropout_W": 0.0, "dropout_U": 0.0, "b_regularizer": null, "batch_input_shape": [null, 9, 1], "W_regularizer": null, "inner_activation": "hard_sigmoid", "inner_init": "orthogonal", "input_length": 9}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_4"}}, {"class_name": "LSTM", "config": {"consume_less": "cpu", "U_regularizer": null, "trainable": true, "go_backwards": false, "dropout_U": 0.0, "stateful": false, "b_regularizer": null, "unroll": false, "init": "glorot_uniform", "name": "lstm_5", "output_dim": 20, "inner_activation": "hard_sigmoid", "input_length": null, "return_sequences": true, "activation": "tanh", "dropout_W": 0.0, "W_regularizer": null, "inner_init": "orthogonal", "forget_bias_init": "one", "input_dim": 10}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_5"}}, {"class_name": "LSTM", "config": {"consume_less": "cpu", "U_regularizer": null, "trainable": true, "go_backwards": false, "dropout_U": 0.0, "stateful": false, "b_regularizer": null, "unroll": false, "init": "glorot_uniform", "name": "lstm_6", "output_dim": 10, "inner_activation": "hard_sigmoid", "input_length": null, "return_sequences": false, "activation": "tanh", "dropout_W": 0.0, "W_regularizer": null, "inner_init": "orthogonal", "forget_bias_init": "one", "input_dim": 20}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "input_dim": null, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "W_regularizer": null, "output_dim": 1, "W_constraint": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_2"}}], "keras_version": "1.1.2"}