{"config": [{"config": {"input_length": 9, "init": "glorot_uniform", "return_sequences": true, "batch_input_shape": [null, 9, 1], "dropout_U": 0.0, "dropout_W": 0.0, "U_regularizer": null, "unroll": false, "input_dtype": "float32", "inner_init": "orthogonal", "consume_less": "cpu", "output_dim": 10, "forget_bias_init": "one", "b_regularizer": null, "activation": "tanh", "input_dim": 1, "name": "lstm_1", "W_regularizer": null, "trainable": true, "stateful": false, "inner_activation": "hard_sigmoid", "go_backwards": false}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"stateful": false, "input_length": null, "unroll": false, "forget_bias_init": "one", "b_regularizer": null, "go_backwards": false, "init": "glorot_uniform", "input_dim": 10, "trainable": true, "return_sequences": true, "dropout_W": 0.0, "inner_init": "orthogonal", "W_regularizer": null, "name": "lstm_2", "activation": "tanh", "U_regularizer": null, "dropout_U": 0.0, "inner_activation": "hard_sigmoid", "consume_less": "cpu", "output_dim": 20}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"stateful": false, "input_length": null, "unroll": false, "forget_bias_init": "one", "b_regularizer": null, "go_backwards": false, "init": "glorot_uniform", "input_dim": 20, "trainable": true, "return_sequences": false, "dropout_W": 0.0, "inner_init": "orthogonal", "W_regularizer": null, "name": "lstm_3", "activation": "tanh", "U_regularizer": null, "dropout_U": 0.0, "inner_activation": "hard_sigmoid", "consume_less": "cpu", "output_dim": 10}, "class_name": "LSTM"}, {"config": {"name": "dropout_3", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "input_dim": null, "bias": true, "name": "dense_1", "W_regularizer": null, "trainable": true, "W_constraint": null, "activity_regularizer": null, "output_dim": 1}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "linear"}, "class_name": "Activation"}], "keras_version": "1.1.2", "class_name": "Sequential"}